[
  {
    id: "the-meetings",
    title: "Meetings, or, The Endless Performance of Cheerfulness",
    date: "10/26/2025",
    html: "<p>I’ve been thinking a lot lately about why I started this channel in the first place. Partly I guess it’s because I wanted a dedicated space to talk about games and other stuff that makes me feel calm, or at least less like I'm being chewed up and spit out by the machinery. But also, I needed something that felt mine. It's almost kind of nice that no one is really watching my vids. There's less pressure to perform.</p><p>My day job pays the bills, but it’s starting to feel like even the small annoyances are overbearing. There’s a performative aspect to it, a kind of enforced enthusiasm that I can’t always muster. I keep nodding along in meetings while a little voice in the back of my head is saying, 'none of this matters.' Then I go home and play something like Unpacking or Mutazione and remember what it feels like to care about small things again. Just focusing on something else for a bit is grounding in a way.</p><p>I had another one of those endless check-ins today. The kind where everyone talks in circles and you can practically hear the life draining out of the room. It really bothers me when meetings go over time because someone just can't shut up. At some point, I caught myself smiling in that automatic way people do when they’re pretending to listen. My cheeks legit hurt.</p><p>There’s this strange contradiction between how exhausting I find these meetings and how easy it is to forget I'm faking it. Like my face knows the choreography better than I do. My default response before I even get a chance to think. I wonder if that’s what corporate life really is: pretending to be invested in things that truly have no soul. And then the pretending becomes like 90% of the job.</p><p>I’m trying to redirect some of that energy here instead. You know, to make vids that feel like they come from an actual person. I know it sounds dramatic, but sometimes I think making things, even small, personal things, is the only real antidote to being slowly assimilated into work culture via Teams meetings and branded wellness emails. I suspect everyone hates it, but we're all too afraid to speak up.</p><p>So, I guess that’s what this site is for too. A place to put the parts of myself that don’t fit anywhere else. Anyway, thanks for stopping by.</p><p>All the best,</p><p>Amy</p>"
  }
]