[
  {
    id: "side-quests",
    title: "The Comfort of Side Quests",
    date: "11/16/2025",
    html: "<p>Lately I’ve been noticing an unfortunate pattern in my gaming habits: I am extremely good at getting almost to the end of things, specifically that last stretch where the game gently points at the final boss or the last major quest and says, 'Okay, whenever you’re ready,' and my brain responds, 'Cool, cool. Time to do literally anything else.'</p><p>If you could see my save files lined up next to each other, they’d look like an endless graveyard of 82% completions. I used to chalk this up to simple procrastination, or the vague sadness that comes with finishing something you liked. There’s always that hollow feeling you get after being so invested in a game. Like...what now? I thought I was just avoiding that feeling. More recently, though, I’ve started to wonder if there’s something else going on. Something about the way I relate to endings in general.</p><p>Side quests are easier to justify. They’re the low-stakes part of the experience. Help this villager find their cat. Gather ten herbs. Bring the curmudgeonly old NPC his favorite tea, and maybe he'll say something endearing. None of it is urgent in the grand cosmic sense, but it is soothing. You get a little burst of progress, a little “Quest Complete” notification, and the illusion that your time is being put to good use.</p><p>Conversely, the main storyline has consequences. It changes things. It moves the story forward in ways that are irreversible. You can’t un-trigger the cutscene that makes the town look different forever. Disco Elysium is a good example of this. Once you cross that threshold, the world is altered, and the game starts counting down toward its own quiet disappearance from your daily routine. It reminds me of back in the day when I'd be having a grand ol' time with one of my childhood friends, and it starts getting late. Inevitably, my mom would give me the signal that it's time to call it a night. I used to get so frustrated. So, I think I have problems with finality.</p><p>So naturally I tend to leave things in the middle. This is not exclusive to games or fun nights, unfortunately. I’ve also been doing this with basically everything else in my life. I’ll start reorganizing my apartment and get it to the “chaotic but promising” stage, where all the big stuff is done and what remains is the annoying detail work: the stray cords, the papers that need a real home, the junk drawer that has turned into a junk ecosystem. That’s when I start to lose momentum. The project stagnates at 82% completion.</p><p>The relatively obvious interpretation is that I have some kind of issue with commitment or endings, which, sure, probably. But I don’t think it’s exactly fear of finishing. It’s more that the middle of things is where I feel the most…potential. When a game is still unfinished, there’s always the option of going back to it. When a room is half-redone, it could still become the ideal version I see in my head. When a blog is half-written, it could still turn into something good. There’s a safety in that unfinished middle state. It’s like living in a save file right before the final boss: technically precarious, but psychologically reassuring. You don’t have to face whatever comes after the ending if you never trigger it in the first place.</p><p>The truly annoying thing is that this doesn’t feel like laziness. Not quite. It feels like a coping strategy. My brain genuinely believes it’s being clever: 'If we don’t finish this, then it can’t disappoint you. It can’t be worse than you hoped. It can’t be measured and found wanting.' There’s something almost superstitious about it, like I’m hoarding potential outcomes in a little jar and refusing to open it in case reality doesn’t live up to the imagined version. Meanwhile, the games sit there on my Steam account, quietly judging me.</p><p>This pattern has been especially noticeable with so-called cozy games, which are *supposed* to be low-pressure. No one is yelling at me to min-max my build in a game where the main mechanic is literally feeding ducks. And yet somehow I’ve managed to turn that into another space where I can linger indefinitely at the liminal threshold of completion without ever stepping over that line into terminal finality.</p><p>If this all sounds a little bleak, I promise it’s not. There’s something genuinely nice about having places to inhabit that don’t demand decisive action. But I do wonder what it means when that habit starts to leak into the rest of my life.</p><p>It’s easy to joke about backlog culture, about how we’re all drowning in unfinished games and unread books and half-watched TV shows. But underneath the jokes is a deeper question: what would it look like to actually pick a few things and see them all the way through? Not in a grindy, 'optimize your productivity' sense, but in a gentler, more intentional way. To accept that endings are part of what give experiences their form, even when they’re kind of uncomfortable.</p><p>It’s kind of strange to admit this in a public post, because it makes me sound way more dramatic than I really am on a daily basis. It's not like I’m walking around in a haze of existential crisis all the time. I go to work. I answer emails. I cook dinner. I play my little games about tidying up rooms and petting cats.</p><p>But if your own life currently looks like a collection of half-finished games and half-finished plans, consider this a gentle, non-judgmental nudge: maybe pick one thing and see it through. Just one. You don’t have to speedrun your entire backlog. You don’t have to become the kind of person who always finishes everything. You just have to close the loop on something, if only to remind yourself that you can. Thanks for reading.</p><p>All the best,</p><p>Amy</p>"
  },
  {
    id: "the-meetings",
    title: "Meetings, or, The Endless Performance of Cheerfulness",
    date: "10/26/2025",
    html: "<p>I’ve been thinking a lot lately about why I started this channel in the first place. Partly I guess it’s because I wanted a dedicated space to talk about games and other stuff that makes me feel calm, or at least less like I'm being chewed up and spit out by the machinery. But also, I needed something that felt mine. It's almost kind of nice that no one is really watching my vids. There's less pressure to perform.</p><p>My day job pays the bills, but it’s starting to feel like even the small annoyances are overbearing. There’s a performative aspect to it, a kind of enforced enthusiasm that I can’t always muster. I keep nodding along in meetings while a little voice in the back of my head is saying, 'none of this matters.' Then I go home and play something like Unpacking or Mutazione and remember what it feels like to care about small things again. Just focusing on something else for a bit is grounding in a way.</p><p>I had another one of those endless check-ins today. The kind where everyone talks in circles and you can practically hear the life draining out of the room. It really bothers me when meetings go over time because someone just can't shut up. At some point, I caught myself smiling in that automatic way people do when they’re pretending to listen. My cheeks legit hurt.</p><p>There’s this strange contradiction between how exhausting I find these meetings and how easy it is to forget I'm faking it. Like my face knows the choreography better than I do. My default response before I even get a chance to think. I wonder if that’s what corporate life really is: pretending to be invested in things that truly have no soul. And then the pretending becomes like 90% of the job.</p><p>I’m trying to redirect some of that energy here instead. You know, to make vids that feel like they come from an actual person. I know it sounds dramatic, but sometimes I think making things, even small, personal things, is the only real antidote to being slowly assimilated into work culture via Teams meetings and branded wellness emails. I suspect everyone hates it, but we're all too afraid to speak up.</p><p>So, I guess that’s what this site is for too. A place to put the parts of myself that don’t fit anywhere else. Anyway, thanks for stopping by.</p><p>All the best,</p><p>Amy</p>"
  }
]