[
  {
    id: "AeZoPMLEyqg",
    title: "Cozy Game Hot Takes 🔥",
    url: "https://www.youtube.com/watch?v=AeZoPMLEyqg",
    description: "Hey everyone. In today’s video, I’m sharing some spicy opinions about cozy gaming that I’ve been holding onto for a while. From pixelated graphics to farming sims and even cozy horror games, I guess I’ve got a lot to say. 😅"
  },
  {
    id: "2x0NdnwruFo",
    title: "Albums I'll Never Get Sick Of 🎸🎸🎸",
    url: "https://www.youtube.com/watch?v=2x0NdnwruFo",
    description: "Hey friends, welcome back to Gaming with Amy! Today’s video is a little different—I'm diving into one of my other passions: music. Specifically, I’m talking about albums I’ll never, ever get sick of. If I do, well…something’s definitely wrong.",
  },
  {
    id: "UD00iIsSAVg",
    title: "Dark and Spooky Cozy Game Recommendations",
    url: "https://www.youtube.com/watch?v=UD00iIsSAVg",
    description: "Hi friends, and Happy Halloween! I'd like to share with you my top dark and spooky cozy games. From narrative-driven adventures to mysterious visual novels, there's something here for every type of gamer. Let’s explore these delightfully spooky games together."
  },
  {
    id: "8yZbJsEVN2g",
    title: "What I've Read Recently (and Recommend!)",
    url: "https://www.youtube.com/watch?v=8yZbJsEVN2g",
    description: "Today’s video is a little different from my usual cozy gaming content because I’m diving into one of my other passions: reading. From creepy horror to fascinating memoirs, I’m sharing some standout books I’ve been into lately. I’ve always loved finding books with that special vibe, and these ones hit the mark."
  },
  {
    id: "zOgM5JHfNF4",
    title: "Chill Cozy Puzzle Games! 🦉",
    url: "https://www.youtube.com/watch?v=zOgM5JHfNF4",
    description: "Hey everyone! Today, I’m diving into some of my favorite cozy puzzle games that are perfect for relaxing and unwinding. Whether you’re in the mood for a calming experience or a cute hidden object game, I’ve got you covered."
  },
  {
    id: "T66ZlkMGK9E",
    title: "Wytchwood Review: A Cozy Crafting Fairytale?",
    url: "https://www.youtube.com/watch?v=T66ZlkMGK9E",
    description: "Wytchwood is a crafting adventure game set in a world of gothic fables and fairytales. In this review, I’ll break down the game’s art style, soundtrack, and gameplay. But does the story deliver? Let’s find out if Wytchwood is worth your time and money."
  },
  {
    id: "YnjYx0IdjDE",
    title: "My Favorite Cozy Games",
    url: "https://www.youtube.com/watch?v=YnjYx0IdjDE",
    description: "I’m Amy, and this is my very first video. I'll be sharing some of the cozy games that have captured my heart over the past year or so."
  }
]